package com.toyfactory.model.service;

public class ToyFactory {

	/*1. 전체 장난감 조회하기: 공장에 있는 모든 장난감의 정보를 출력
	2. 새로운 장난감 만들기: 새로운 장난감을 추가하고, 사용자가 입력한 정보로
	객체를 생성
	3. 장난감 삭제하기: 공장에서 장난감을 삭제
	4. 장난감 제조일 순으로 조회하기: 장난감을 제조일에 따라 정렬하여 출력
	5. 연령별 사용 가능한 장난감 리스트 조회하기: 사용 가능한 연령을 입력받고,
	해당하는 장난감을 출력
	6. 재료 추가: 새로운 재료를 등록하고, 장난감에 해당 재료를 추가
	7. 재료 제거: 등록된 재료를 삭제하고, 해당하는 재료를 사용하는 장난감에서
	제거

	반드시 지켜야 할 사항
	1. 장난감은 똑같은 재료를 중복으로 저장할 수 없다.
	2. 똑같은 장난감을 만들 수 없다.
	3. 장난감을 저장할 컬렉션에 중복된 장난감이 있어서는 안된다.
	4. 재료는 { 고유번호 : 재료명 } 형식으로 작성되어 있어야 한다.
	5. 재료의 고유번호는 중복될 수 없다.
	6. 재료 등록 시 이미 등록된 고유번호의 재료가 있으면, 덮어쓰겠냐는 질문을 하고 y/n
	으로 답변을 입력받아 처리해야 한다.
	7. 재료 삭제 시 고유번호가 아닌, 재료명을 입력받아 같은 재료명이 있으면 삭제한다.*/
	
}
